configuration/src/ChartsOfCharacteristicTypes/ВидыНастроекФилиалов/ВидыНастроекФилиалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыНастроекФилиалов</name>
  <type>
    <types>CatalogRef.Филиалы</types>
    <types>CatalogRef.ЮридическиеЛица</types>
    <types>CatalogRef.ВидыЗадач</types>
    <types>Boolean</types>
    <types>CatalogRef.НаправленияРазработки</types>
    <types>CatalogRef.Процессы</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.СистемыУчета</types>
    <types>CatalogRef.НазначенияЗадач</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>200</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>КонтрольКачества</name>
      <description>Настройки тестирования</description>
      <code>000000028</code>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Основное</name>
      <description>Основное</description>
      <code>000000053</code>
    </items>
    <items>
      <name>ПроцессРазработки</name>
      <description>Процесс разработки</description>
      <code>000000006</code>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
      <code>000000004</code>
    </items>
    <items>
      <name>СотрудникиФилиала</name>
      <description>Сотрудники филиала</description>
      <code>000000047</code>
    </items>
    <items>
      <name>Трудозатраты</name>
      <description>Трудозатраты</description>
      <code>000000001</code>
      </content>
      </content>
    </items>
  </predefined>
  <attributes>
    <name>ВариантГруппировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйРеквизит</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекФилиалов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСписокВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьЗаголовок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКакПодраздел</name>
    <comment>Истина - будет группа будет представлена подразделом. Ложь - будетотображена как группа с заголовком на родительской странице</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <comment>Текст подсказки, которая будет отображаться в виде контекстной подсказки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСледования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скрытый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПерезапуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокВыбора</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ВидыНастроекФилиалов</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыФилиалов</name>
    <attributes>
      <name>ТипФилиала</name>
      <type>
        <types>EnumRef.ТипыФилиалов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

configuration/src/Enums/ТипыФилиалов/ТипыФилиалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФилиалов</name>
  <enumValues>
    <name>IT</name>
  </enumValues>
  <enumValues>
    <name>НеIT</name>
  </enumValues>
  <enumValues>
    <name>QA</name>
  </enumValues>
</mdclass:Enum>

configuration/src/ChartsOfCharacteristicTypes/ВидыНастроекФилиалов/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет обработчики обновления
//
// Параметры:
//  Обработчики	 - ТаблицаЗначений	 - см. ПриложениеВызовСервера.ПолучитьОбработчикиДанных
//
Процедура ДобавлениеОбработчиковОбновления(Обработчики) Экспорт     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ПланыВидовХарактеристик.ВидыНастроекФилиалов.ПроверитьПредопределенныеЭлементы";
	  
КонецПроцедуры

// Проверяет предопределенные настройки
//
Процедура ПроверитьПредопределенныеЭлементы() Экспорт 
	
	Тип_IT_QA = Новый Массив; 
	Тип_IT_QA.Добавить(Перечисления.ТипыФилиалов.IT);
	Тип_IT_QA.Добавить(Перечисления.ТипыФилиалов.QA);

	Тип_QA = Новый Массив; 
	Тип_QA.Добавить(Перечисления.ТипыФилиалов.QA);

	Тип_IT = Новый Массив; 
	Тип_IT.Добавить(Перечисления.ТипыФилиалов.IT);

	Тип_Все = Новый Массив; 
	Тип_Все.Добавить(Перечисления.ТипыФилиалов.IT);
	Тип_Все.Добавить(Перечисления.ТипыФилиалов.QA);
	Тип_Все.Добавить(Перечисления.ТипыФилиалов.НеIT);  

	ЗаполнитьПредопределеннуюГруппу("СотрудникиФилиала", 1, "Вертикальная");		
	
	Группа = "Основное";
	ЗаполнитьПредопределеннуюГруппу(Группа, 2, "");	
	ЗаполнитьПредопределенныйЭлемент("НаправлениеРазработки", "", 1, "",,, Истина,,,, Группа);   
	
	ЗаполнитьПредопределеннуюГруппу("КомандыРазработчиков", 1, "",, Истина, Тип_IT_QA);
	
	ЗаполнитьПредопределеннуюГруппу("СвязанныеФилиалы", 3, "",, Истина);
	ЗаполнитьПредопределеннуюГруппу("РазрабатываемыеСистемы", 4, "",, Истина, Тип_IT_QA); 
	
	Группа = "ПроцессРазработки";
	ЗаполнитьПредопределеннуюГруппу(Группа, 3, "Вертикальная",,, Тип_Все);		
	ЗаполнитьПредопределенныйЭлемент("ФилиалТестирования", "", 1, "",,, Истина,, Истина, Тип_IT, Группа);      
	ЗаполнитьПредопределенныйЭлемент("КомандаТестирования", "", 2, "",,, Истина,,, Тип_IT, Группа); 
	ЗаполнитьПредопределенныйЭлемент("ОцениватьЗадачиВStoryPoint", "", 4, "",,, Истина,,, Тип_IT_QA, Группа); 
	
    Группа = "CodeReview";
	ЗаполнитьПредопределеннуюГруппу(Группа, 1, "Вертикальная",, Истина, Тип_IT);		
	ЗаполнитьПредопределенныйЭлемент("ИсполнителяCodeReviewНазначаетРуководитель", "", 1, "",,, Истина,,, Тип_IT, Группа); 
	
	Группа = "АвтопулЗадач";
	ЗаполнитьПредопределеннуюГруппу(Группа, 1, "Вертикальная",, Истина, Тип_IT);
	ЗаполнитьПредопределенныйЭлемент("ИспользованиеАвтопулаЗадач", "", 1, "",, Истина, Истина,,, Тип_IT, Группа); 
	ЗаполнитьПредопределенныйЭлемент("ОтображатьСложностьЗадач", "", 2, "ИспользованиеАвтопулаЗадач",,, Истина,,, Тип_IT, Группа); 
	
	Группа = "ПодсветкаСрокаРеализации";
	ЗаполнитьПредопределеннуюГруппу(Группа, 5, "Горизонтальная",,, Тип_IT);		
	ЗаполнитьПредопределенныйЭлемент("ПодсвечиватьПриПриближенииСрокаРеализации", "", 1, "",, Истина, Истина,,, Тип_IT, Группа); 
	ЗаполнитьПредопределенныйЭлемент("КоличествоДнейДоСрокаРеализации", "", 2, "ПодсвечиватьПриПриближенииСрокаРеализации",,,,,, Тип_IT, Группа); 
	
	Группа = "ГруппаПроцессУстановкиСтатусов";
	ЗаполнитьПредопределеннуюГруппу(Группа, 8, "Вертикальная", Истина);		
	ЗаполнитьПредопределенныйЭлемент("ПроцессУстановкиСтатусовВнутреннееЗадание", "", 1, "",,, Истина,,,, Группа); 
	ЗаполнитьПредопределенныйЭлемент("ПроцессУстановкиСтатусов", "", 2, "",,, Истина,,, Тип_IT_QA, Группа); 
	
	Группа = "КонтрольКачества";
	ЗаполнитьПредопределеннуюГруппу(Группа, 4, "Вертикальная",,, Тип_QA);		
	ЗаполнитьПредопределенныйЭлемент("ЗапросСозданияЗадачиАвтотеста", "", 1, "",,, Истина,,, Тип_QA, Группа); 
	ЗаполнитьПредопределенныйЭлемент("РазрешениеРаботатьСПуломЗадач", "", 2, "",,, Истина,,, Тип_QA, Группа); 
	ЗаполнитьПредопределенныйЭлемент("УведомлятьОПереводеЗадач", "", 3, "",,, Истина,,, Тип_QA, Группа); 
	
	Группа = "Автотесты";
	ЗаполнитьПредопределеннуюГруппу(Группа, 1, "Вертикальная",,, Тип_QA);		
	ЗаполнитьПредопределенныйЭлемент("ПрефиксЗадачиАвтотеста", "", 1, "",,, Истина,,, Тип_QA, Группа); 
	ЗаполнитьПредопределенныйЭлемент("ТипДляЗадачиАвтотеста", "", 2, "",,, Истина,,, Тип_QA, Группа); 	
	
	Группа = "Документация";
	ЗаполнитьПредопределеннуюГруппу(Группа, 1, "Вертикальная",,, Тип_QA);		
	ЗаполнитьПредопределенныйЭлемент("ПрефиксЗадачиДокументации", "", 1, "",,, Истина,,, Тип_QA, Группа); 
	ЗаполнитьПредопределенныйЭлемент("ТипДляЗадачиДокументации", "", 2, "",,, Истина,,,Тип_QA, Группа); 	
	
	Группа = "ЗаполнениеДополнительныхЗадач";
	ЗаполнитьПредопределеннуюГруппу(Группа, 1, "Вертикальная",,, Тип_QA);
	ЗаполнитьПредопределенныйЭлемент("НазначениеДополнительныхЗадач", "", 1, "",,, Истина,,, Тип_QA, Группа); 
	ЗаполнитьПредопределенныйЭлемент("НаправлениеДополнительныхЗадач", "", 2, "",,, Истина,,, Тип_QA, Группа); 
	ЗаполнитьПредопределенныйЭлемент("СистемаУчетаДополнительныхЗадач", "", 3, "",,, Истина,,, Тип_QA, Группа); 
	
	ЗаполнитьПредопределеннуюГруппу("ТипыЗадач", 1, "",, Истина, Тип_QA); 
	
	ЗаполнитьПредопределеннуюГруппу("Трудозатраты", 5, "Вертикальная");		
	ЗаполнитьПредопределеннуюГруппу("ВидыДеятельности", 1, "Вертикальная",, Истина);
	
	Группа = "НапоминанияОТрудозатратах";
	ЗаполнитьПредопределеннуюГруппу(Группа, 2, "Вертикальная", Истина,, Тип_IT_QA);
	ЗаполнитьПредопределенныйЭлемент("УведомлятьОТрудозатратах", "", 1, "",, Истина, Истина,,,, Группа); 
    ЗаполнитьПредопределенныйЭлемент("ВремяНапоминанияОТрудозатратах", "", 2, "УведомлятьОТрудозатратах",,, Истина,,, Тип_IT_QA, Группа);
	
	Группа = "ВнутренниеТрудозатраты";
	ЗаполнитьПредопределеннуюГруппу(Группа, 3, "", Истина);		
	Подсказка = "При занесении трудозатрат у сотрудника будет автоматически сниматься флаг активности.";
	ЗаполнитьПредопределенныйЭлемент("СниматьАктивностьПриЗанесенииТрудозатрат", Подсказка, 1, "",,, Истина,,,, Группа); 

	Группа = "Прочее";
	ЗаполнитьПредопределеннуюГруппу(Группа, 7, "Вертикальная");		
	
	Список = Новый СписокЗначений;      
	Список.Добавить(-8, "Калининградское время (МСК-1)");
	Список.Добавить(-7, "Московское время (МСК)");
	Список.Добавить(-6, "Самарское время (МСК+1)");
	Список.Добавить(-5, "Екатеринбургское время (МСК+2)");
	Список.Добавить(-4, "Омское время (МСК+3)");
	Список.Добавить(-3, "Красноярское время (МСК+4)");
	Список.Добавить(-2, "Иркутское время (МСК+5)");
	Список.Добавить(-1, "Якутское время (МСК+6)");
	Список.Добавить(0, "Владивостокское время (МСК+7)");
	Список.Добавить(1, "Магаданское время (МСК+8)");
	Список.Добавить(2, "Камчатское время (МСК+9)");

	ЗаполнитьПредопределенныйЭлемент("СмещениеЧасовогоПоясаОтносительноВладивостока", "", 1, "", Список,, Истина,,,, Группа); 

КонецПроцедуры     

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредопределенныйЭлемент(ИмяЭлемента, Подсказка, ПорядокСледования, ГлавныйРеквизит, СписокВыбора = Неопределено,
	Основной = Ложь, ОтображатьЗаголовок = Ложь, Скрытый = Ложь, СохранятьИсториюИзменений = Ложь, ТипыФилиалов = Неопределено, Родитель = "")
 
	Попытка
		Объект = ОбщегоНазначения.ПредопределенныйЭлемент("ПланВидовХарактеристик.ВидыНастроекФилиалов." + ИмяЭлемента);
	Исключение
		Сообщение = НСтр("ru = 'Предопределенная группа ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "ПланыВидовХарактеристик.ВидыНастроекФилиалов." + ИмяЭлемента);
		ВызватьИсключение Сообщение;
	КонецПопытки;
	
	Если Объект = Неопределено Тогда  
		Сообщение = НСтр("ru = 'Предопределенная группа ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "ПланыВидовХарактеристик.ВидыНастроекФилиалов." + ИмяЭлемента);
		ВызватьИсключение Сообщение;
	КонецЕсли;

	Объект = Объект.ПолучитьОбъект();  
	
	Если Объект.ПорядокСледования = 0 Тогда 	
		Объект.ПорядокСледования = ПорядокСледования;
		Объект.ГлавныйРеквизит = ОбщегоНазначения.ПредопределенныйЭлемент("ПланВидовХарактеристик.ВидыНастроекФилиалов." + ГлавныйРеквизит);
		Объект.Основной = Основной;
		Объект.ОтображатьЗаголовок = ОтображатьЗаголовок;
		Объект.СохранятьИсториюИзменений = СохранятьИсториюИзменений;
		Объект.ИспользоватьСписокВыбора = СписокВыбора <> Неопределено;
		
		Если Родитель <> "" Тогда 
			Объект.Родитель = ОбщегоНазначения.ПредопределенныйЭлемент("ПланВидовХарактеристик.ВидыНастроекФилиалов." + Родитель);
		КонецЕсли;
		
		Если Объект.ИспользоватьСписокВыбора Тогда 
			Объект.СписокВыбора.Очистить();
			
			Для Каждого Элемент Из СписокВыбора Цикл  
				НоваяСтрока = Объект.СписокВыбора.Добавить();
				НоваяСтрока.Значение = Элемент.Значение;
				НоваяСтрока.Представление = Элемент.Представление;
			КонецЦикла;
		КонецЕсли; 
		
		Если ТипыФилиалов <> Неопределено Тогда 
			Объект.ТипыФилиалов.Очистить();
			
			Для Каждого Элемент Из ТипыФилиалов Цикл  
				НоваяСтрока = Объект.ТипыФилиалов.Добавить();
				НоваяСтрока.ТипФилиала = Элемент;
			КонецЦикла;
		КонецЕсли;
		
		Объект.Записать();                     
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПредопределеннуюГруппу(ИмяЭлемента, ПорядокСледования, ВариантГруппировки,
	ОтображатьЗаголовок = Ложь, ОтображатьКакПодраздел = Ложь, ТипыФилиалов = Неопределено)
 
	Попытка
		Объект = ОбщегоНазначения.ПредопределенныйЭлемент("ПланВидовХарактеристик.ВидыНастроекФилиалов." + ИмяЭлемента);
	Исключение
		Сообщение = НСтр("ru = 'Предопределенная группа ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "ПланыВидовХарактеристик.ВидыНастроекФилиалов." + ИмяЭлемента);
		ВызватьИсключение Сообщение;
	КонецПопытки;
	
	Если Объект = Неопределено Тогда  
		Сообщение = НСтр("ru = 'Предопределенная группа ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "ПланыВидовХарактеристик.ВидыНастроекФилиалов." + ИмяЭлемента);
		ВызватьИсключение Сообщение;
	КонецЕсли;
	
	Объект = Объект.ПолучитьОбъект();  
	
	Если Объект.ПорядокСледования = 0 Тогда
		Объект.ВариантГруппировки = ВариантГруппировки;
		Объект.ПорядокСледования = ПорядокСледования;
		Объект.ОтображатьЗаголовок = ОтображатьЗаголовок;
		Объект.ОтображатьКакПодраздел = ОтображатьКакПодраздел;   
		
		Если ТипыФилиалов <> Неопределено Тогда 
			Объект.ТипыФилиалов.Очистить();
			
			Для Каждого Элемент Из ТипыФилиалов Цикл  
				НоваяСтрока = Объект.ТипыФилиалов.Добавить();
				НоваяСтрока.ТипФилиала = Элемент;
			КонецЦикла;
		КонецЕсли;
		
		Объект.Записать();                     
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
